arq-emp AS-IS/Diagrama de Clases (Nivel Dominio)/01 - Diagrama de Clases de Dominio (Nivel Dominio).md
```mermaid
classDiagram
    direction TB

    %% 1. Núcleo Pedido y Despacho
    class Pedido {
        +numeroPedido : String
        +estadoPedido : String
        +promesaEntrega : String
        +fechaDespacho : DateTime
        +fechaEntregaEstimada : Date
    }

    class Bulto {
        +formatoCaja : String
        +estadoFisico : String
    }

    class RegistroDespacho {
        +codigoDespacho : String
        +fechaHoraSalida : DateTime
        +supervisorDespacho : String
        +conformidadCarga : Boolean
    }

    %% 2. Comercial y Destino
    class Consultora {
        +codigoConsultora : String
        +nombreTitular : String
        +telefonoContacto : String
    }

    class DireccionEntrega {
        +departamento : String
        +provincia : String
        +distrito : String
        +direccionDetallada : String
        +tipoCiudad : String
    }

    %% 3. Transporte y Red Logística
    class SocioLogistico {
        +razonSocial : String
        +ruc : String
        +zonaAsignada : String
    }

    class ModalidadTransporte {
        <<Abstract>>
        +tipoModalidad : String
        +descripcionRuta : String
    }

    class TransporteTerrestre {
        +tipoRedVial : String
    }

    class TransporteBimodal {
        +tramoTerrestre : String
        +tramoFluvial : String
    }

    class TransporteAereo {
        +rutaAerea : String
    }

    %% 4. Entrega y Receptor
    class RegistroEntrega {
        +fechaHoraEntrega : DateTime
        +estadoConfirmacion : String
        +observacionesEntrega : String
    }

    class Receptor {
        <<Abstract>>
        +nombreReceptor : String
        +documentoIdentidad : String
        +condicionReceptor : String
    }

    class ConsultoraTitular
    class PersonalAutorizado {
        +parentescoRelacion : String
    }

    %% 5. Contingencias y Logística Inversa
    class IncidenciaEntrega {
        +tipoIncidencia : String
        +fechaHoraIncidencia : DateTime
        +motivoDetallado : String
        +disponibilidadBulto : Boolean
    }

    class OrdenRetorno {
        +codigoRetorno : String
        +fechaHoraInicioRetorno : DateTime
        +motivoRetorno : String
        +estadoRetorno : String
    }

    %% Relaciones de Dominio
    Consultora "1" -- "1..*" Pedido
    Pedido "1" *-- "1..*" Bulto
    Pedido "1" -- "1" RegistroDespacho
    Pedido "1" -- "1" DireccionEntrega
    SocioLogistico "1" -- "1..*" Pedido
    Pedido "1" -- "1" ModalidadTransporte
    Pedido "1" -- "0..1" RegistroEntrega
    RegistroEntrega "1" -- "1" Receptor
    Pedido "1" -- "0..1" IncidenciaEntrega
    IncidenciaEntrega "1" -- "0..1" OrdenRetorno

    ModalidadTransporte <|-- TransporteTerrestre
    ModalidadTransporte <|-- TransporteBimodal
    ModalidadTransporte <|-- TransporteAereo

    Receptor <|-- ConsultoraTitular
    Receptor <|-- PersonalAutorizado
```
